---
kind: other
id: Methods.T:Autodesk.Revit.DB.HostObjAttributes
source: html/cba26cc6-bb9f-8038-a99c-b42845ead9f6.htm
---
# HostObjAttributes Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.